{
  "20897": {},
  "19872": {
    "what is average package for btech cse in lpu": [
      " The maximum salary offered to LPUs B Tech CSE student was was 40 LPA and the average salary was 5.7lpa. Recently, an LPU student Tanya Arora got placed in Microsoft with 42 LPA this year. The placement season from LPU becomes the favorite landing place for top recruiters like Cognizant Technology Solutions, Tech Mahindra, Capgemini, Amazon, Bosch Engineering, Tata Consultancy Services, Federal Bank, and many more! In engineering, the NIRF rank of LPU is 66. The Times World University Rankings 2022 LPU Is at no 22 on Times Higher Education List. Outlook ranks LPU at number 9 in Outlook Care rankings and The Times of India ranks LPU at no 36 in the list of engineering institutes. LPU received an Employability award by Aspiring Mind in 2020 for best placement Institute in India.",
      ["B.E /B.Tech", "LPU Phagwara", "Computer Science Engineering"],
      7635
    ],
    "which one is better lpu or Chandigarh university": [
      " Hi Deepraj, CU is a good university. LPU is one of the top private university in India and among top 200 in the world. I have listed reasons below for anyone to choose LPU above others. International Exposure: Not only in India, LPU is renowned internationally. LPU has a dedicated Division of International affairs. LPU has ties with Multiple foreign Universities all over the world. Students can take the opportunity to opt for Credit Transfer Program, Semester Exchange Program, Summer / Winter School Program. With this provision, students will get the opportunity of being educated with the advanced technologies of the world renowned Universities. With the huge diversity in campus, students also get the provision of cultural exchange. Attendance : LPU is also very strict on the attendance of the students. 75% attendance is mandatory for the students at any cost. This is nothing but to make the students systematic & punctual in life. Student’s Club: With the aim of all-round development of students, so that students would be getting emerged strongly in each & every domain of life, there are nearly 60 student organizations or clubs created by Lovely Professional University. With this initiative students will never feel alone on campus. Hostel: I have also spent 5 Years in LPU Hostel. There I always feel it’s happening all the time !! 0% Ragging, 0% tolerance to any illegal substances like alcohol, drugs etc. Strict action used to be taken against the defaulters in case of non-adherence of such rules. Though there are many restrictions you can observe for the hostellers but believe me at the end of day you will find it necessary for all your security & safety. These restrictions would definitely make you learn how to lead your life in a controlled environment. Faculties: LPU Professors are always beside the students for their well-being & enhancing their educational standard. Professors of LPU are very friendly & helpful in nature with an intimate, interactive, personalized approach to learning. Students are also allocated with Academic & Industry mentors from Day 1 for guidance till the last academic semester. Infrastructure: 1. LPU is a 600+ Acre campus with all advanced facilities & infrastructures (Hospital, Shopping Mall, Gym, Indoor Stadium, Post Office, Bank, Food Courts with International cuisines, Hostel Facility etc.) 2. There are huge well maintained open grounds for outdoor games. Lovely Professional University does have an Olympic Standard swimming pool within the campus inside the SHANTI DEVI MITTAL INDOOR STADIUM. Diving pool & warming up pool are also adjacent to Swimming Pool. LPU is also having the best trainers to train students rightly, and with full safety & security. 3. Students can practice a variety of sports like Badminton, Basketball, Shooting, Boxing, or avail the GYM facility. Placement: Let me quote the placement scenario of last session as I got to know from my alumni page of LPU, In terms of placement in 2020, it was really tough for all to proceed further. It’s tough for a University who wants to promote its students to get excellent placement. It’s tough for the companies also to take decisions on the acquisition of excellent young talents. Thanks to the availability of advanced technologies, upgraded stuffs in LPU & since the students were well prepared by LPU to overcome any of the situations to achieve their final goal, Lovely Professional University managed to achieve excellent placement record as always by securing more than 7000 job offers, internships, training for its students",
      [
        "Christ University, Bangalore",
        "LPU Phagwara",
        "Computer Science Engineering"
      ],
      6337
    ],
    "Can i get admission in lpu if i scored 80% in plus two without writing lpunest?": [
      " Direct admission is available to very few courses like BA etc, I would suggest to give LPUNEST exam for better chance of getting scholarship. The eligibility criteria for scholarship in Lovely Professional University are the performance in LPU NEST Sports, Research and Culture, the person with a disability, board toppers, orphan candidates, based on bravery award & social services, and defense personnel. University extends Scholarship and Financial Aid Scheme which is an initiative by the University to cultivate the talent of students that may be hidden due to financial constraints. Scholarship/ Financial Aid can be availed in all the Programmes of the University, ranging from Diploma to Ph.D. In the last seven years, University has offered Scholarships/ Financial Aid worth 500+ Crores.",
      ["LPU Phagwara", "LPU NEST", "Admission"],
      6262
    ],
    "What's total fee of LPU for btech? Including hostel, mess and other fee.": [
      " For fees of the course and hostel, I would recommend to check the LPU website. that will give you a clear picture.  Lovely Professional University is one of the best private university offering Bachelors, Masters, certificate and doctoral degrees in various fields.   It is situated in Phagwara in Punjab state of India. Established in 2006, it is accredited from UGC, BCI, PCI, AIU,Council of Architecture (COA), NCTE, IAP, ICAR and it is affiliated to Lovely Professional University. LPU, Phagwara offers 418 courses across 18 streams namely Engineering, Management, Design, Paramedical, IT, Commerce & Banking, Hotel Management, Physical Education, Arts, Performing Arts, Science, Law, Pharmacy, Agriculture, Education, Media & Mass Communication, Vocational, Medical and across 10 degrees like B.Tech, BSc, BA, B.Des, BBA.    Strong academia-industry connection       :-     With a plenty of study opportunities, LPU provide students with global excellence and industry immersion. This university has collaborated with the top-notch brands such as Google, Cisco, Oracle, SAP, Microsoft and many more to have its center of excellence, students from south get numerous chances to work directly with the companies on live projects to get a practical exposure. This helps the students to get an insight about the recent trends of the industries. There are hardly any university or college in south having such a exposure and deep collaboration.    Unbeatable Placement Records is Now a Habit:       -     LPU has one of the best placement records in the whole of India and that is why students want to join LPU to get placed. Right from Google to Microsoft, LPU alumni are working with the top brands at the package of 1 crore and above. Annually, more than 450 brands come to LPU to recruit the students, where 90% of them are MNCs. Moreover, 80+ companies that recruit from IITs and NITs also recruit from LPU. Over the last three years, Cognizant alone has recruited 1900+ students from LPU campus and has been titled with the “Most Employable Students” consecutively twice in a row by the India's top talent company “Aspiring Minds”. Barring few names in south, there are hardly any college which can boast of such tall records. ",
      ["LPU Phagwara", "B.E /B.Tech", "Fees"],
      6091
    ],
    "is lovely professional university good or bad for b.tech/b.e.": [
      " LPU is not only good for B Tech programmes but also for other programmes as well. LPU has well-tailored course content to meet the global industrial needs, good faculty, and state-of-the-art facilities that have left many NITs far behind. The curriculum taught here is of international standard. One gets to learn from foreign and industry experts. There are provisions of international credits in some programs where a student gets an opportunity to go abroad to study. Highlights of B Tech courses,-   IITs and NITs are also appreciating campus-wide facilities in terms of IT.     Online access to research journals, leading company annual reports, and business dissertations with design analysis for ERP.    Design and Development of software and databases for data analysis.   Option to opt for industry-relevant and industry-delivered skills to enhance placement prospects.   Student-driven activities for leadership and technological development   Software exhibitions on applications and research projects.   Backup and support by top companies for academics and curriculum like Microsoft, IBM, Cognizant, etc.  LPU always designed the innovative pedagogy of the courses based on Industry standards only. Based on the same students are getting Industry ready from Day one. LPU offers B.Tech courses with various specializations such as EEE, EE, ECE, Robotics and Automation, CE, CSE, AE, Aerospace E, IT, Mechatronics, Mechanical, etc, and many more. Fortune 500 Companies have hired around 4500 students from Lovely Professional University. The wide array of employers that hire LPU students is remarkable, representing LPU students' potential and ingenuity in shaping the LPU Vertos have secured placement offers from Amazon at a dream package of up to Rs. 30 Lac per annum. The placement season from LPU becomes the favorite landing place for top recruiters like Cognizant Technology Solutions, Tech Mahindra, Capgemini, Amazon, Bosch Engineering, Tata Consultancy Services, Federal Bank, and many more! In engineering, the NIRF rank of LPU is 66. The Times World University Rankings 2022 LPU Is at no 22 on Times Higher Education List. Outlook ranks LPU at number 9 in Outlook Care rankings and The Times of India ranks LPU at no 36 in the list of engineering institutes. LPU received an Employability award by Aspiring Mind in 2020 for best placement Institute in India.",
      ["B.E /B.Tech", "LPU Phagwara"],
      5358
    ]
  },
  "19985": {
    "Is Chandigarh University Fake placement?": [
      " Hello, No, Chandigarh University does not have fake placement record.   Chandigarh University  has been awarded with the title \"   University  with Best   Placements  \" in India. With more than 627 Multi-Nationals visiting CU Campus in 2018-19, the number of offers have touched 6314 and the highest package has registered a growth of 30% & have scaled to a new high of 31.77 LPA. With   627  companies making   6314  offers to students, Chandigarh University has become the first university in India to hold   Limca Book of Records  for the highest number of companies in 1 academic year. If we see only Computer science and IT department there are more than 85% students placed previously. Companies like Amazon, Walt Disney, Microsoft, Deloitte, Sap Labs, Capegemini, Wipro, IBM and many more have come for placements and many students of this university have been placed. Highest Package: Engineering- Rs. 32.5 LPA Management- Rs. 14 LPA Hospitality- Rs. 18 LPA So, Chandigarh University does not have fake placements. It holds a good placement record till now. Hope it helps. Good Luck!",
      ["Chandigarh University, Chandigarh", "Placement"],
      2905
    ],
    "Avg package of cse in Chandigarh university": [
      "   Chandigarh University is NAAC A+ University and Highest Package offered is 35 Lacs and average Package is 7 Lacs. University is known for its Placements and International Internships.  ",
      ["Chandigarh University, Chandigarh"],
      2081
    ],
    "I got 67 percentile in jee mains 2020 through general category so can I get admission in Chandigarh university on the basis of my jee mains percentile? suggest me": [
      " Yes you can totally get into CU with a 67 percentile in JEE mains 2020, if you’re seeking admission in any of the engineering streams under CU. Further I would like to mention the admission criteria for getting into CU.  The student must score 65% and above in their 10+2 for general category and 55% and above for the reserved category.   For getting into a B.tech course, the student must have a combination of PCM for general engineering streams such as Mechanical/Computer science/ Electrical/Civil/Aerospace and should have a combination of PCM or PCB or PCMB for other branches such as biotechnology/food technology etc.   Direct admission can also be done through CUCET( chandigarh University common entrance test) which is basically a scholarship programme ensuring 100% scholarship to deserving candidates. This examination is conducted prior to admission procedures.   Summing up: Being a Private University, Lower JEE score can also fetch you a seat in CU. But, scholarships are provided on the basis of your JEE marks. Redemption of 10% is provided on each semester fee if the student gets a good JEE score. ",
      [
        "JEE Main",
        "chandigarh",
        "Admission",
        "Chandigarh University, Chandigarh",
        "Admission"
      ],
      1738
    ],
    "is CUCET (Chandigarh University common entrance test) difficult . what is the syllabus": [
      "                                                        Hello,Chandigarh University common entrance test is neither tough or easy it all depends on your preparation if you will prepare well for the entrance exam according to the syllabus then you can easily crack it. The syllabus of CUCET 2021 for undergraduate programmes will be divided into two parts and a total of four sections.The Part Aconsist of questions from English, Numerical Aptitude, Data Interpretation, Analytical Skills, Reasoning, General Aptitude and General Knowledge.The Part Bof CUCET syllabus 2021 for UG programmes will consist of four sections, Physics, chemistry, Biology and Mathematics. There will be hundred questions of hundred marks and the duration will be 2 hours.For more details, you can checkout the link below: https://www.google.com/amp/s/university.careers360.com/articles/cucet-syllabus/amp",
      [
        "CUET",
        "Chandigarh University, Chandigarh",
        "Chandigarh University Common Entrance Test",
        "Syllabus"
      ],
      1654
    ],
    "How can I get the Chandigarh University (CUCET) exam sample question papers?": [
      "                                                        Hello student student Chandigarh University release its own sample paper for its common entrance test CUCET. I'm mentioning a link mentioned below you can download each subjects sample paper from there very easilyhttp://cucet.cuchd.in/sample-papers.phpFeel free to comment if you have any doubtGood luck                                                                                          ",
      ["CUET", "Chandigarh University, Chandigarh", "University"],
      1528
    ]
  }
}
